000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. Taschenrechner.
000300 DATA DIVISION.
000400 FILE SECTION.
000500 WORKING-STORAGE SECTION.
000600 01  RECHEN_ART PICTURE IS x.
000700 01  ERSTE_ZAHL PICTURE IS 99999.
000800 01  ZWEITE_ZAHL PICTURE IS 99999.
000900 01  LOESUNG PICTURE IS 9999999.

000400 PROCEDURE DIVISION.
000500 DISPLAY "Welche Rechenart?".
000600 ACCEPT RECHEN_ART
000700 ACCEPT ERSTE_ZAHL
000800 ACCEPT ZWEITE_ZAHL
000900 IF RECHEN_ART = "+"
001000 ADD ERSTE_ZAHL TO ZWEITE_ZAHL GIVING LOESUNG.
000900 IF RECHEN_ART = "-"
001000 SUBTRACT ZWEITE_ZAHL FROM ERSTE_ZAHL GIVING LOESUNG.
000900 IF RECHEN_ART = "*"
001000 MULTIPLY ERSTE_ZAHL BY ZWEITE_ZAHL GIVING LOESUNG.
000900 IF RECHEN_ART = "/"
001000 DIVIDE ERSTE_ZAHL BY ZWEITE_ZAHL GIVING LOESUNG.
001100 DISPLAY LOESUNG
000600 STOP RUN.
